{
  "_name_or_path": "Skywork/Skywork-OR1-7B-Preview",
  "architectures": [
    "Qwen2ForCausalLM"
  ],
  "auto_map": {
        "AutoConfig": "configuration_qwen2_vacc.Qwen2Config",
        "AutoModel": "modeling_qwen2_vacc.Qwen2ForCausalLM",
        "AutoModelForCausalLM": "modeling_qwen2_vacc.Qwen2ForCausalLM"
    },
  "attention_dropout": 0.0,
  "bos_token_id": 151643,
  "eos_token_id": 151643,
  "hidden_act": "silu",
  "hidden_size": 3584,
  "initializer_range": 0.02,
  "intermediate_size": 18944,
  "max_position_embeddings": 131072,
  "max_window_layers": 28,
  "model_type": "qwen2",
  "num_attention_heads": 28,
  "num_hidden_layers": 28,
  "num_key_value_heads": 4,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 10000,
  "sliding_window": null,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.45.2",
  "use_cache": true,
  "use_mrope": false,
  "use_sliding_window": false,
  "vocab_size": 152064,
  "attn_implementation": "eager",
  "insert_slice": true
}
