{
    "architectures": [
      "AquilaModel"
    ],
    "auto_map": {
      "AutoConfig": "configuration_aquila.AquilaConfig",
      "AutoModelForCausalLM": "modeling_aquila_vacc.AquilaForCausalLM"
    },
    "bos_token_id": 100006,
    "eos_token_id": 100007,
    "hidden_act": "silu",
    "hidden_size": 4096,
    "initializer_range": 0.02,
    "intermediate_size": 11008,
    "max_position_embeddings": 2048,
    "model_type": "aquila",
    "num_attention_heads": 32,
    "num_hidden_layers": 32,
    "pad_token_id": 0,
    "rms_norm_eps": 1e-05,
    "tie_word_embeddings": false,
    "torch_dtype": "float16",
    "transformers_version": "4.31.0",
    "use_cache": true,
    "vocab_size": 100008
  }