{
    "_name_or_path": "Qwen/Qwen2-VL-7B-Instruct-319-PRO",
    "architectures": [
      "Qwen2VLForConditionalGeneration"
    ],
    "auto_map": {
      "AutoConfig": "configuration_qwen2_vl.Qwen2VLConfig",
      "AutoModel": "modeling_qwen2_vl_vacc.Qwen2VLForConditionalGeneration",
      "AutoProcessor": "processing_qwen2_vl.Qwen2VLProcessor"
    },
    "attention_dropout": 0.0,
    "bos_token_id": 151643,
    "eos_token_id": 151645,
    "hidden_act": "silu",
    "hidden_size": 3584,
    "image_token_id": 151655,
    "initializer_range": 0.02,
    "intermediate_size": 18944,
    "max_position_embeddings": 32768,
    "max_window_layers": 28,
    "model_type": "qwen2_vl",
    "num_attention_heads": 28,
    "num_hidden_layers": 28,
    "num_key_value_heads": 4,
    "rms_norm_eps": 1e-06,
    "rope_scaling": {
      "mrope_section": [
        16,
        24,
        24
      ],
      "type": "mrope"
    },
    "rope_theta": 1000000.0,
    "sliding_window": 32768,
    "tie_word_embeddings": false,
    "torch_dtype": "float16",
    "transformers_version": "4.45.0.dev0",
    "use_cache": true,
    "use_sliding_window": false,
    "video_token_id": 151656,
    "vision_config": {
      "in_chans": 3,
      "model_type": "qwen2_vl",
      "spatial_patch_size": 14
    },
    "vision_end_token_id": 151653,
    "vision_start_token_id": 151652,
    "vision_token_id": 151654,
    "vocab_size": 152064,
    "_attn_implementation": "eager",
    "insert_slice": true
  }
  