{
    "architectures": [
      "Qwen2ForCausalLM"
    ],
    "attention_dropout": 0.0,
    "bos_token_id": 151643,
    "eos_token_id": 151645,
    "hidden_act": "silu",
    "hidden_size": 3584,
    "initializer_range": 0.02,
    "intermediate_size": 18944,
    "max_position_embeddings": 32768,
    "max_window_layers": 28,
    "model_type": "qwen2",
    "num_attention_heads": 28,
    "num_hidden_layers": 28,
    "num_key_value_heads": 4,
    "quantization_config": {
      "bits": 4,
      "checkpoint_format": "gptq",
      "desc_act": false,
      "group_size": 128,
      "lm_head": false,
      "meta": {
        "damp_auto_increment": 0.0025,
        "damp_percent": 0.1,
        "mse": 0.0,
        "quantizer": [
          "gptqmodel:2.0.0-dev"
        ],
        "static_groups": false,
        "true_sequential": true,
        "uri": "https://github.com/modelcloud/gptqmodel"
      },
      "pack_dtype": "int32",
      "quant_method": "gptq",
      "sym": true
    },
    "rms_norm_eps": 1e-06,
    "rope_theta": 1000000.0,
    "sliding_window": 32768,
    "tie_word_embeddings": false,
    "torch_dtype": "float16",
    "transformers_version": "4.50.0.dev0",
    "use_cache": true,
    "use_sliding_window": false,
    "vocab_size": 152064
  }
  