{
    "architectures": [
        "Qwen3ForCausalLM"
    ],
    "auto_map": {
        "AutoConfig": "configuration_qwen2_vacc.Qwen2Config",
         "AutoModel": "modeling_qwen2_vacc.Qwen2ForCausalLM", 
         "AutoModelForCausalLM": "modeling_qwen2.Qwen2ForCausalLM"
    },
    "attention_bias": false,
    "attention_dropout": 0.0,
    "bos_token_id": 151643,
    "eos_token_id": 151643,
    "head_dim": 128,
    "hidden_act": "silu",
    "hidden_size": 1024,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "max_position_embeddings": 32768,
    "max_window_layers": 28,
    "model_type": "qwen3",
    "num_attention_heads": 16,
    "num_hidden_layers": 28,
    "num_key_value_heads": 8,
    "rms_norm_eps": 1e-06,
    "rope_scaling": null,
    "rope_theta": 1000000,
    "sliding_window": null,
    "tie_word_embeddings": true,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.51.3",
    "use_cache": false,
    "use_sliding_window": false,
    "vocab_size": 151669,
    "rank_num": 1,
    "iter_num": 0,
    "model_name": "qwen",
    "align_qkv": 0,
    "input_seq_len": 512,
    "split_dtype": "torch.float32",
    "args_dtype": "fp32",
    "insert_slice": 0,
    "_attn_implementation": "eager"
}
